from random import *
import matplotlib.pyplot as plt
import numpy as np

"""№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№ 
Здесь набор функций, который я постепенно дополняю для решения более ебаных задач
№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№ """
#Генерация броска монетки -----------------------------------------------------
def OP(n,k):
    c  = ''
    for _ in range(n):
        n = randint(0,k)
        if n % 2 == 0:
           c += 'О'
        else:
           c += 'Р'
    return c
#Функция подсчёта вероятности--------------------------------------------------
def probability (x,n,k,l,m):
    summ = 0
    for i in range(l):
        c = OP(n,k)
        cnt = 0
        for j in range(n):
            if x in c[j]:
                cnt+=1
        if cnt == m:
            summ+=1
    return summ/l    
        
      
""" №№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№
Здесь основной алгоритм
№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№"""    

n = int(input('Число бросков: '))#Число подряд идущих бросков в единичном акте измерения
k = int(input('Коэфф. рандомайзера: '))#Просто ставь 1000 и не задавайся вопросом, что это. Если посмотришь на функцию - увидишь
x = input('Распределение вероятности какой стороны нужно найти: ')# Либо О, либо Р - транслит русский
l = int(input('Количество испытаний: '))
P = []

for i in range(n+1):
    P.append(probability(x,n,k,l,i))
        
#Здесь просто строятся графики-------------------------------------------------
c = [-1,0]
d = np.zeros(len(c))        
plt.figure()
plt.plot(c,d)
for i in range(n+1):
    d[0] += P[i]
    d[1] += P[i]
    c[0] += 1
    c[1] += 1
    plt.plot(c,d)
    
#------------------------------------------------------------------------------            
    